Config = Config or {}
Config.SpawnMarker 	= { type = 36, r = 94, g = 180, b = 191, a=100, x = 1.85, y = 1.5, z = 1.2 }									-- Marker ของจุดเบิกรถ
Config.DeleteMarker = { type = 6, r = 255, g = 51, b = 51, a=100, x = 4.0, y = 4.0, z = 0.30 }									    -- Marker ของจุดเก็บรถ (HorizontalSplitArrowCircle)
-- Config.DeleteMarker2 = { type = 36, r = 255, g = 51, b = 51, a=100, x = 1.7, y = 1.7, z = 1.2 }									    -- Marker ของจุดเก็บรถ


-- job = { 'police', 'ambulance', 'council' },ถ้าใส่ จะให้เฉพาะคนที่มี job เท่านั้นถึงจะใช้ได้
-- deletelocation ไม่ใส่ก็ได้
-- vehicletype = 'car' , 'boat' , 'helicopter'
Config.garageDetail = {

    -- {   
    --     name        = 'event_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
    --     labelname   = 'EVENT GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
    --     location    = vector3(-1469.344, -1487.731, 2.0722439),              ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(-1456.014, -1474.749, 2.0722439),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 325.55117,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',
    --     deletelocation = vector3(-1480.627, -1469.665, 2.2769656),           ------------------------------ จุดเก็บรถ

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 147.17845                                             ------------------------------ ทิศทาง Prop เบิกรถ
    --     },
    --     Propdelete = { 
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 136.97219                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },

    {   
        name        = 'yl_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'YELLOW GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-336.6209, -977.8207, 31.080091),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-336.0669, -976.2336, 31.080091),            ------------------------------ จุด Spawn รถ
        spawnheading  = 342.47,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-359.5485, -964.5596, 31.080097),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 162.39,
            useConfigZ = true  -- 👈 ถ้าใส่อันนี้ก็ไม่ต้องหาพื้น ใช้ z ตาม config เลย
            ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 145.76                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-333.1043, -979.0552, 31.080083),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-332.5077, -977.2586, 31.080083),            ------------------------------ จุด Spawn รถ
        spawnheading  = 341.54,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 164.19                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-329.6533, -980.2556, 31.080083),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-329.0006, -978.6005, 31.080083),            ------------------------------ จุด Spawn รถ
        spawnheading  = 341.08,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 163.03                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-326.1991, -981.5869, 31.080083),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-325.6171, -979.8433, 31.080083),            ------------------------------ จุด Spawn รถ
        spawnheading  = 342.56,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 163.93                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'green_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'GREEN GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(288.86352, -229.2568, 53.874965),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(289.26617, -230.5408, 53.932434),            ------------------------------ จุด Spawn รถ
        spawnheading  = 199.92,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(290.77175, -266.9627, 54.017383),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 18.05                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 161.77                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(283.55535, -227.7154, 53.892837),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(284.07699, -229.1672, 53.956985),            ------------------------------ จุด Spawn รถ
        spawnheading  = 200.92,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 17.96                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(294.22961, -231.3204, 53.880207),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(294.62979, -232.5177, 53.931396),            ------------------------------ จุด Spawn รถ
        spawnheading  = 198.01,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 18.53                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    -- {   
    --     location      = vector3(1707.2878, 3762.1862, 34.260345),            ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(1707.2878, 3762.1862, 34.260345),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 313.25,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 320.9                                                  ------------------------------ ทิศทาง Prop เบิกรถ
    --     }
    -- },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'pink_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'PINK GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(897.66131, -45.33312, 78.764076),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(898.58477, -45.93598, 78.764076),            ------------------------------ จุด Spawn รถ
        spawnheading  = 237.27,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(925.12725, -105.1982, 78.764152),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 59.73                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 203.74                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    {   
        deletelocation = vector3(935.75939, 0.2493717, 78.76406),                                            ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 327.94                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(895.68524, -48.29307, 78.764076),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(896.96722, -49.02011, 78.764076),            ------------------------------ จุด Spawn รถ
        spawnheading  = 241.36,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 58.12                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(893.91613, -51.17468, 78.764076),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(895.12603, -51.93442, 78.764076),            ------------------------------ จุด Spawn รถ
        spawnheading  = 238.60,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 59.27                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(892.09417, -54.07263, 78.764076),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(893.35559, -54.81647, 78.764076),            ------------------------------ จุด Spawn รถ
        spawnheading  = 239.10,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 58.06                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'brown_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'BROWN GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-1307.277, 280.89822, 64.26155),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1307.968, 279.78286, 64.156448),            ------------------------------ จุด Spawn รถ
        spawnheading  = 148.99,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-1313.648, 284.49166, 64.210456),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 329.21                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 328.52                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-1303.559, 278.41186, 64.278861),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1304.324, 277.13351, 64.161323),            ------------------------------ จุด Spawn รถ
        spawnheading  =  148.29,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 329.33                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-1291.315, 270.28125, 64.268646),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1292.047, 269.09704, 64.158592),            ------------------------------ จุด Spawn รถ
        spawnheading  = 149.13,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 329.83                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-1287.965, 268.14953, 64.265151),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1288.736, 267.01843, 64.154891),            ------------------------------ จุด Spawn รถ
        spawnheading  = 147.03,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 329.80                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'black_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'BLACK GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-179.5297, -2032.88, 27.62042),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-180.7565, -2032.455, 27.62042),            ------------------------------ จุด Spawn รถ
        spawnheading  = 71.27,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-176.0452, -2021.469, 27.620409),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 251.72                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 260.31                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-180.7085, -2036.033, 27.62042),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-181.9728, -2035.581, 27.62042),            ------------------------------ จุด Spawn รถ
        spawnheading  = 69.74,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 248.29                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-182.0668, -2039.08, 27.62042),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-183.4721, -2038.548, 27.62042),            ------------------------------ จุด Spawn รถ
        spawnheading  = 69.46,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 248.86                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-183.2564, -2042.06, 27.620414),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-184.6629, -2041.5, 27.620414),            ------------------------------ จุด Spawn รถ
        spawnheading  = 67.33,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 249.33                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'white_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'WHITE GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1022.3178, -779.8635, 57.850688),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1023.2051, -779.1019, 57.888992),            ------------------------------ จุด Spawn รถ
        spawnheading  = 312.10,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(1011.0598, -766.7151, 57.88068),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 129.84                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 127.91                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(1024.5988, -782.7476, 57.848602),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1025.4848, -782.0106, 57.881099),            ------------------------------ จุด Spawn รถ
        spawnheading  = 311.09,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 131.72                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(1026.9257, -785.6, 57.848258),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1028.1949, -784.5373, 57.895362),            ------------------------------ จุด Spawn รถ
        spawnheading  = 310.39,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 128.20                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(1029.3112, -788.5503, 57.84737),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1030.4268, -787.6219, 57.884983),            ------------------------------ จุด Spawn รถ
        spawnheading  = 311.75,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 131.85                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    -- {   
    --     name        = 'purple_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
    --     labelname   = 'PURPLE GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
    --     location    = vector3(-824.6259, -2360.593, 14.570701),              ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(-823.9746, -2359.411, 14.570702),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 330.55,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',
    --     deletelocation = vector3(-837.4171, -2332.847, 14.570621),           ------------------------------ จุดเก็บรถ

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 151.40                                                  ------------------------------ ทิศทาง Prop เบิกรถ
    --     },
    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 88.52                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },

    -- -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- -- {   
    -- --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    -- --     vehicletype   = 'car',

    -- --     Propdelete = {
    -- --         model   = "un_bendix_prop_deposit_assist",
    -- --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    -- --     }
    -- -- },
    
    -- -- จุดเบิก ภายในการาจเดียวกัน
    -- {   
    --     location      = vector3(-821.6972, -2362.318, 14.570702),            ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(-820.9244, -2361.012, 14.570702),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 329.73,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 150.54                                                  ------------------------------ ทิศทาง Prop เบิกรถ
    --     }
    -- },

    -- {   
    --     location      = vector3(-818.683, -2364.017, 14.570704),            ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(-817.9799, -2362.79, 14.570704),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 330.88,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 152.98                                                  ------------------------------ ทิศทาง Prop เบิกรถ
    --     }
    -- },

    -- {   
    --     location      = vector3(-815.7035, -2365.723, 14.570704),            ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(-814.9544, -2364.441, 14.570704),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 328.98,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 150.71                                                 ------------------------------ ทิศทาง Prop เบิกรถ
    --     }
    -- },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'purple_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'PURPLE GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-801.9891, -1315.579, 5.0003824),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-801.7041, -1313.912, 5.0003824),            ------------------------------ จุด Spawn รถ
        spawnheading  = 350.61,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-790.882, -1334.996, 5.0003824),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 173.18                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 173.76                                                 ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-805.0489, -1315.005, 5.00038),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-804.6777, -1313.087, 5.00038),            ------------------------------ จุด Spawn รถ
        spawnheading  = 350.37,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 170.35                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-811.515, -1313.897, 5.0003838),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-811.2199, -1312.254, 5.0003829),            ------------------------------ จุด Spawn รถ
        spawnheading  = 351.23,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 169.31                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-814.6784, -1313.331, 5.0003829),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-814.308, -1311.531, 5.0003829),            ------------------------------ จุด Spawn รถ
        spawnheading  = 349.59,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 171.63                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'red_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'RED GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-1087.676, -316.8032, 37.666183),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1089.705, -316.5888, 37.662494),            ------------------------------ จุด Spawn รถ
        spawnheading  = 87.34,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-1141.249, -320.0026, 37.673496),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 266.15                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 85.15                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-1087.207, -309.3198, 37.658035),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1088.892, -309.0942, 37.655792),            ------------------------------ จุด Spawn รถ
        spawnheading  = 85.78,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 265.02                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-1086.469, -301.8746, 37.647621),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1088.294, -301.6664, 37.647502),            ------------------------------ จุด Spawn รถ
        spawnheading  = 84.31,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 264.17                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    -- {   
    --     location      = vector3(-1119.743, -308.7961, 37.66835),            ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(-1119.893, -310.3382, 37.670928),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 174.71,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 354.41                                                  ------------------------------ ทิศทาง Prop เบิกรถ
    --     }
    -- },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'blue_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'BLUE GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-2046.03, -452.1411, 11.424705),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-2047.286, -453.636, 11.389944),            ------------------------------ จุด Spawn รถ
        spawnheading  = 142.90,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-2056.128, -437.3428, 11.507142),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 323.30                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 51.00                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    {   
        deletelocation = vector3(-1990.554, -488.4706, 11.59764),                                            ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 233.98                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-2043.678, -454.1718, 11.424023),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-2045.024, -455.7643, 11.386897),            ------------------------------ จุด Spawn รถ
        spawnheading  = 141.04,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 319.87                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-2041.212, -456.1564, 11.425294),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-2042.473, -457.6636, 11.390189),            ------------------------------ จุด Spawn รถ
        spawnheading  = 141.82,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 322.74                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-2011.534, -481.0445, 11.428817),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-2012.906, -482.5435, 11.392675),            ------------------------------ จุด Spawn รถ
        spawnheading  = 139.30,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 322.42                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-2009.234, -482.8685, 11.430939),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-2010.572, -484.3932, 11.394798),            ------------------------------ จุด Spawn รถ
        spawnheading  = 141.14,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 322.46                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-2006.843, -484.9304, 11.43098),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-2008.132, -486.4933, 11.394967),            ------------------------------ จุด Spawn รถ
        spawnheading  = 141.13,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 322.37                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'grave_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'GRAVE GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-1661.764, -207.9092, 55.284332),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1660.076, -208.4989, 55.220691),            ------------------------------ จุด Spawn รถ
        spawnheading  = 251.41,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-1674.698, -243.3523, 54.62775),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 82.12                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 74.40                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-1660.522, -204.5229, 55.356781),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1658.669, -205.1475, 55.266651),            ------------------------------ จุด Spawn รถ
        spawnheading  = 252.00,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 72.95                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-1659.333, -201.1564, 55.412925),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1657.441, -201.8846, 55.307807),            ------------------------------ จุด Spawn รถ
        spawnheading  = 251.39,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 74.09                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-1658.192, -197.8219, 55.460067),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1656.152, -198.513, 55.349697),            ------------------------------ จุด Spawn รถ
        spawnheading  = 251.84,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 71.32                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'peach_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'PEACH GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-1050.861, -1420.458, 5.4254403),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1048.748, -1421.032, 5.4254403),            ------------------------------ จุด Spawn รถ
        spawnheading  = 254.59,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-1050.714, -1409.998, 5.4254379),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 72.52                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 167.10                                                 ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-1052.759, -1427.416, 5.4254426),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1050.799, -1427.976, 5.4254412),            ------------------------------ จุด Spawn รถ
        spawnheading  = 255.00,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 78.99                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-1057.563, -1426.399, 5.4254331),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1059.495, -1425.832, 5.4254336),            ------------------------------ จุด Spawn รถ
        spawnheading  = 77.17,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 257.46                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-1055.675, -1419.09, 5.4254422),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1057.774, -1418.504, 5.4254422),            ------------------------------ จุด Spawn รถ
        spawnheading  = 75.92,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 255.80                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'mint_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'MINT GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-328.0885, 295.86062, 86.219955),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-330.0591, 295.75827, 86.097587),            ------------------------------ จุด Spawn รถ
        spawnheading  = 94.86,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-349.194, 300.22854, 84.968414),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 273.63                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 7.35                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-328.1407, 292.38687, 86.216316),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-330.1647, 292.25775, 86.086357),            ------------------------------ จุด Spawn รถ
        spawnheading  = 93.96,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 269.35                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-328.0717, 288.9504, 86.213111),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-330.1058, 288.80416, 86.086166),            ------------------------------ จุด Spawn รถ
        spawnheading  = 95.69,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 276.60                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-327.8878, 285.25985, 86.256797),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-329.8778, 285.03192, 86.119476),            ------------------------------ จุด Spawn รถ
        spawnheading  = 95.79,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 276.56                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'beige_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'BEIGE GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-501.9409, -258.4474, 35.541095),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-501.1305, -260.1553, 35.507663),            ------------------------------ จุด Spawn รถ
        spawnheading  = 203.26,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-488.5762, -252.9373, 35.677646),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 24.79                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 25.29                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(-507.5865, -260.5908, 35.491779),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-506.8114, -262.3693, 35.505313),            ------------------------------ จุด Spawn รถ
        spawnheading  = 202.81,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 27.95                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-515.6433, -263.9415, 35.405746),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-514.9499, -265.8276, 35.401676),            ------------------------------ จุด Spawn รถ
        spawnheading  = 204.27,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 23.34                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(-521.5933, -266.417, 35.321697),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-520.8262, -268.2674, 35.313224),            ------------------------------ จุด Spawn รถ
        spawnheading  = 204.41,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 22.31                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------

    {   
        name        = 'salmon_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'SALMON GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(30.919301, -1579.579, 29.275144),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(32.504367, -1580.886, 29.217912),            ------------------------------ จุด Spawn รถ
        spawnheading  = 231.97,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(26.380517, -1593.635, 29.303293),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 49.66                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 143.77                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(38.629497, -1570.012, 29.292121),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(40.243305, -1571.368, 29.292394),            ------------------------------ จุด Spawn รถ
        spawnheading  = 233.89,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 47.60                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(56.610477, -1548.705, 29.460233),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(58.031173, -1549.939, 29.460205),            ------------------------------ จุด Spawn รถ
        spawnheading  = 231.35,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 51.44                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(64.485923, -1539.38, 29.460157),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(66.129272, -1540.718, 29.460159),            ------------------------------ จุด Spawn รถ
        spawnheading  = 231.67,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 53.31                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------
    {   -- หน้าคุก
        name        = 'prison_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'PRISON GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1853.5352, 2571.4108, 45.672073),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1855.5385, 2571.4472, 45.672065),            ------------------------------ จุด Spawn รถ
        spawnheading  = 270.46,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(1853.5343, 2556.6616, 45.672073),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 93.11                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 89.30                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    -- {   
    --     deletelocation = vector3(1720.6622, 3775.0854, 34.369995),                                            ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propdelete = {
    --         model   = "un_bendix_prop_deposit_assist",
    --         heading = 216.97                                                  ------------------------------ ทิศทาง Prop เก็บรถ
    --     }
    -- },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(1853.5834, 2575.1594, 45.672065),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1855.6652, 2575.1679, 45.672065),            ------------------------------ จุด Spawn รถ
        spawnheading  = 271.49,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 91.64                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(1853.6044, 2578.9567, 45.672065),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1855.624, 2578.9938, 45.672065),            ------------------------------ จุด Spawn รถ
        spawnheading  = 269.58,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 92.01                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    -- {   
    --     location      = vector3(64.485923, -1539.38, 29.460157),            ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(66.129272, -1540.718, 29.460159),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 231.67,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 53.31                                                  ------------------------------ ทิศทาง Prop เบิกรถ
    --     }
    -- },

-----------------------------------------------------------------------------------------------------------------------------------------------
    {   -- ทะเลทราย
        name        = 'desert_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'DESERT GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1708.0306, 3775.9086, 34.533176),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1709.2032, 3774.173, 34.476684),            ------------------------------ จุด Spawn รถ
        spawnheading  = 213.64,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(1721.3695, 3771.9567, 34.28009),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 37.16                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 212.40                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- จุดเก็บรถมากกว่า 1 จุด ภายในการาจเดียวกัน
    {   
        deletelocation = vector3(1718.6091, 3716.7875, 34.183578),                                            ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 112.87                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(1703.4731, 3764.1794, 34.355415),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1705.0202, 3765.8845, 34.38557),            ------------------------------ จุด Spawn รถ
        spawnheading  = 314.09,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 139.14                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(1706.4304, 3761.6132, 34.25661),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1707.6772, 3763.1403, 34.281414),            ------------------------------ จุด Spawn รถ
        spawnheading  = 320.38,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 139.94                                                ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },
-----------------------------------------------------------------------------------------------------------------------------------------------

    {    -- เมืองบน
        name        = 'uppercity_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'UPPERCITY GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(115.8479, 6597.6655, 32.016094),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(117.72087, 6599.6108, 32.011596),            ------------------------------ จุด Spawn รถ
        spawnheading  = 314.82,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(108.91745, 6604.9296, 31.864866),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 133.85                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 134.28                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(120.58207, 6593.0507, 32.053615),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(122.08177, 6594.5273, 32.019065),            ------------------------------ จุด Spawn รถ
        spawnheading  = 316.37,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 135.02                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        location      = vector3(125.77619, 6587.9072, 31.945781),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(127.15515, 6589.3847, 31.943473),            ------------------------------ จุด Spawn รถ
        spawnheading  = 315.70,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 134.83                                                ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },
-----------------------------------------------------------------------------------------------------------------------------------------------

    {   -- การาจโรงบาลทั่วไปของประชาชน
        name        = 'medic_n_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1188.169, -1543.747, 34.692424),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1185.669, -1543.767, 34.692424),            ------------------------------ จุด Spawn รถ
        spawnheading  = 88.87,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(1169.8007, -1553.725, 34.692501),           ------------------------------ จุดเก็บรถ
        DelRadius = 8.0,
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 268.70                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 92.31                                ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },
    
    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        location      = vector3(1188.3322, -1550.388, 34.692413),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1185.6289, -1550.365, 34.692424),            ------------------------------ จุด Spawn รถ
        spawnheading  = 90.09,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 272.20                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    -- {   
    --     location      = vector3(125.77619, 6587.9072, 31.945781),            ------------------------------ จุดเบิกรถ
    --     spawnlocation = vector3(127.15515, 6589.3847, 31.943473),            ------------------------------ จุด Spawn รถ
    --     spawnheading  = 315.70,                                              ------------------------------ ทิศทางหน้ารถ
    --     vehicletype   = 'car',

    --     Propspawn = {
    --         model   = "un_bendix_prop_garage_assist",
    --         heading = 134.83                                                ------------------------------ ทิศทาง Prop เบิกรถ
    --     }
    -- },

    -----------------------------------------------------------------------------------------------------------------------------------------------
    {   -- การาจสภาทั่วไปของประชาชน
        name        = 'council_n_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-401.017, 1120.3874, 327.44009),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-400.4438, 1122.4804, 327.44009),            ------------------------------ จุด Spawn รถ
        spawnheading  = 344.61,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-383.0975, 1127.5405, 327.43984),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        DelRadius = 6.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 166.18                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 254.44                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    {   
        location      = vector3(-406.99, 1122.0743, 327.44012),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-406.3399, 1124.3071, 327.44018),            ------------------------------ จุด Spawn รถ
        spawnheading  = 343.58,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 169.50                                                ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------
    {   -- police city
        name        = 'police_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'POLICE GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(417.93197, -991.5492, 29.33595),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(408.24768, -984.5088, 29.266183),            ------------------------------ จุด Spawn รถ
        spawnheading  = 55.84,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        DelRadius = 6.0,
        deletelocation = vector3(453.08773, -1025.793, 28.521163),           ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },


        Propspawn = {
            model   = "un_bendix_prop_police_assist",
            heading = 272.47                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 185.46                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    -- ทั่วไป ของ ตร.
    {
        name        = 'police_n_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(458.89941, -990.924, 30.689569),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(408.05319, -998.1407, 29.266357),            ------------------------------ จุด Spawn รถ
        spawnheading  = 53.0,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(464.35467, -1017.191, 28.085861),           ------------------------------ จุดเก็บรถ
        Radius = 2.0,
        -- Propspawn = {
        --     model   = "un_bendix_prop_garage_assist",
        --     heading = 267.99                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        -- },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 273.18634                                                ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },
-----------------------------------------------------------------------------------------------------------------------------------------------
    {   -- police sand
        name        = 'police_garage_sand1',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'POLICE SAND GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1853.4786, 3676.6149, 33.785419),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1854.5605, 3674.7011, 33.690616),            ------------------------------ จุด Spawn รถ
        spawnheading  = 208.25,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(1867.3354, 3684.5434, 33.757259),           ------------------------------ จุดเก็บรถ
        DelRadius = 8.0,
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,

        Propspawn = {
            model   = "un_bendix_prop_police_assist",
            heading = 29.29                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 185.46                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },

    {   -- police sand
        name        = 'police_garage_sand2',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'POLICE SAND GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1850.2083, 3674.6818, 33.784309),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1850.9205, 3672.9138, 33.734531),            ------------------------------ จุด Spawn รถ
        spawnheading  = 208.25,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',          ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,

        Propspawn = {
            model   = "un_bendix_prop_police_assist",
            heading = 29.29                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 185.46                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },
    
-----------------------------------------------------------------------------------------------------------------------------------------------
    {   -- medical
        name        = 'medical_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'MEDICAL GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1163.569, -1563.702, 34.692432),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1165.5311, -1563.816, 34.692432),            ------------------------------ จุด Spawn รถ
        spawnheading  = 270.50,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        -- deletelocation = vector3(1173.2092, -1566.104, 34.692432),           ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,

        Propspawn = {
            model   = "un_bendix_prop_medical_assist",
            heading = 91.53                                         ------------------------------ ทิศทาง Prop เบิกรถ
        },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 180.418                                                 ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },

    -- จุดเบิก ภายในการาจเดียวกัน
    {   
        name        = 'medical_garage2',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'MEDICAL GARAGE', 
        location      = vector3(1163.5731, -1560.467, 34.692428),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1165.6826, -1560.458, 34.69242),            ------------------------------ จุด Spawn รถ
        spawnheading  = 267.17,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_medical_assist",
            heading = 91.53                                                ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

    {   
        name        = 'medical_garage3',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'MEDICAL GARAGE', 
        location      = vector3(1163.5102, -1557.162, 34.692428),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1165.8447, -1557.126, 34.692428),            ------------------------------ จุด Spawn รถ
        spawnheading  = 267.17,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_medical_assist",
            heading = 92.23                                                ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },

-----------------------------------------------------------------------------------------------------------------------------------------------
    {   -- medical sand
        name        = 'medical_garage_sand1',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'MEDICAL SAND GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1834.6423, 3665.4641, 33.718841),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1835.5988, 3663.6923, 33.766532),            ------------------------------ จุด Spawn รถ
        spawnheading  = 208.25,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(1867.3354, 3684.5434, 33.757259),           ------------------------------ จุดเก็บรถ
        DelRadius = 8.0,
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,
        DelRadius = 6.0,
        Propspawn = {
            model   = "un_bendix_prop_medical_assist",
            heading = 29.29                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 29.29                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    {   -- medical sand
        name        = 'medical_garage_sand2',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'MEDICAL SAND GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1831.4349, 3663.4206, 33.795211),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1832.2893, 3661.7336, 33.888916),            ------------------------------ จุด Spawn รถ
        spawnheading  = 208.25,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',                                               ------------------------------ จุดเก็บรถ
        deletelocation = vector3(1841.4445, 3668.9804, 33.673297),
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,
        DelRadius = 6.0,
        Propspawn = {
            model   = "un_bendix_prop_medical_assist",
            heading = 29.29                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },

    },

-----------------------------------------------------------------------------------------------------------------------------------------------
    {   -- council
        name        = 'council_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'COUNCIL GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-450.1156, 1134.3688, 327.44021),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-449.5163, 1136.7025, 327.44018),            ------------------------------ จุด Spawn รถ
        spawnheading  = 344.84,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-460.7427, 1149.8162, 327.44006),           ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },
        DelRadius = 6.0,
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_councill_assist",
            heading = 164.31                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 73.45                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },

    {   
        name        = 'council_garage3',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'COUNCIL GARAGE', 
        location      = vector3(-444.2966, 1132.593, 327.44012),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-443.4999, 1135.1248, 327.44012),            ------------------------------ จุด Spawn รถ
        spawnheading  = 344.80,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_councill_assist",
            heading = 166.54                                               ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },
-----------------------------------------------------------------------------------------------------------------------------------------------
-- พาวน์ในเมือง
    {   
        deletelocation = vector3(400.59347, -1632.12, 29.291996),                                            ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        DelRadius = 6.0,
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 48.655548                                                ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },
-----------------------------------------------------------------------------------------------------------------------------------------------
-- Helicopter
    { 
        name        = 'heli_police_city',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'POLICE HELICOPTER GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(457.49337, -977.5633, 43.691886),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(449.21456, -981.2398, 43.691707),            ------------------------------ จุด Spawn รถ
        spawnheading  = 87.72,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'helicopter',
        deletelocation = vector3(449.21456, -981.2398, 43.691707),           ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },
        DelRadius = 6.0,
        Radius = 2.0,

        Propspawn = {
            model   = "un_bendix_prop_police_assist",
            heading = 269.07519                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 29.29                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },
    { 
        name        = 'heli_police_sand',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'POLICE HELICOPTER GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1859.2235, 3654.125, 34.041259),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1856.461, 3640.5576, 35.96315),            ------------------------------ จุด Spawn รถ
        spawnheading  = 32.6,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'helicopter',
        -- deletelocation = vector3(1856.461, 3640.5576, 35.96315),           ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },
        -- DelRadius = 6.0,
        Radius = 2.0,

        Propspawn = {
            model   = "un_bendix_prop_police_assist",
            heading = 207.41056                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 29.29                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },
    { 
        name        = 'heli_medical_city',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'MEDICAL HELICOPTER GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1151.9333, -1546.733, 48.144744),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1141.9699, -1562.791, 48.14479),            ------------------------------ จุด Spawn รถ
        spawnheading  = 1.5,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'helicopter',
        deletelocation = vector3(1141.9671, -1562.805, 48.14479),           ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },
        Radius = 2.0,
        DelRadius = 6.0,
        Propspawn = {
            model   = "un_bendix_prop_medical_assist",
            heading = 272.76                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 29.29                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },
    { 
        name        = 'heli_medical_sand',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'MEDICAL HELICOPTER GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(1844.4379, 3645.2026, 34.196952),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(1856.461, 3640.5576, 35.96315),            ------------------------------ จุด Spawn รถ
        spawnheading  = 32.6,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'helicopter',
        deletelocation = vector3(1856.461, 3640.5576, 35.96315),           ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },
        DelRadius = 6.0,
        Radius = 2.0,

        Propspawn = {
            model   = "un_bendix_prop_medical_assist",
            heading = 207.41056                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 29.29                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },
    { 
        name        = 'heli_council_city',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'COUNCIL HELICOPTER GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-433.949, 1058.203, 350.51593),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-424.4115, 1067.379, 350.50772),            ------------------------------ จุด Spawn รถ
        spawnheading  = 348.18789,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'helicopter',
        deletelocation = vector3(-424.4115, 1067.379, 350.50772),           ------------------------------ จุดเก็บรถ
        job = { 'police', 'ambulance', 'council' },
        DelRadius = 6.0,
        Radius = 2.0,

        Propspawn = {
            model   = "un_bendix_prop_councill_assist",
            heading = 72.79                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        -- Propdelete = {
        --     model   = "un_bendix_prop_deposit_assist",
        --     heading = 29.29                                                  ------------------------------ ทิศทาง Prop เก็บรถ
        -- }
    },
-----------------------------------------------------------------------------------------------------------------------------------------------
-- Admin House
    {   -- จุดเบิก หน้าทางเข้า
        name        = 'admin_house_garage',                                              ------------------------------ ชื่อการาจใน DATA [ห้ามตัวพิมพ์ใหญ่ / ห้ามเว้นวรรค / ห้ามตั้งชื่อยาว / ถ้าจะเว้นให้ใช้ _ แทน]
        labelname   = 'GARAGE',                                          ------------------------------ ชื่อการาจที่แสดง
        location    = vector3(-1622.932, 77.001159, 61.75785),              ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1616.623, 52.377002, 61.856609),            ------------------------------ จุด Spawn รถ
        spawnheading  = 335.62,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        deletelocation = vector3(-1610.033, 69.268966, 61.214534),           ------------------------------ จุดเก็บรถ
        DelRadius = 6.0,
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 327.81                                                  ------------------------------ ทิศทาง Prop เบิกรถ
        },
        Propdelete = {
            model   = "un_bendix_prop_deposit_assist",
            heading = 329.73                               ------------------------------ ทิศทาง Prop เก็บรถ
        }
    },
    
    -- จุดเบิก ตรงโต๊ะคราฟ
    {   
        location      = vector3(-1567.015, 108.74916, 57.579399),            ------------------------------ จุดเบิกรถ
        spawnlocation = vector3(-1626.235, 57.790576, 62.220439),            ------------------------------ จุด Spawn รถ
        spawnheading  = 331.04,                                              ------------------------------ ทิศทางหน้ารถ
        vehicletype   = 'car',
        Radius = 2.0,
        Propspawn = {
            model   = "un_bendix_prop_garage_assist",
            heading = 46.77                                                 ------------------------------ ทิศทาง Prop เบิกรถ
        }
    },
-----------------------------------------------------------------------------------------------------------------------------------------------

}
